tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/drivers"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "railwaycat/emacsmacport"
tap "d12frosted/emacs-plus"
tap "int128/kubelogin"
tap "argoproj/homebrew-tap"

#cask "1password" # does currently not work when installed via cask
cask "launchbar"
#cask "adguard"
#cask "cheatsheet"
#cask "colorpicker-skalacolor"
cask "dash"
#cask "dropbox"
cask "discord"
cask "docker"
#cask "flux"
#cask "gitter"
cask "google-chrome"
#cask "google-drive-file-stream"
cask "font-iosevka-nerd-font"
cask "font-fira-sans"
cask "hammerspoon"
cask "istat-menus"
cask "iterm2"
cask "insomnia"
cask "intellij-idea"
#cask "key-codes"
#cask "llvm"
#cask "mactex"
cask "mailmate"
cask "moneymoney"
cask "nvidia-web-driver"
#cask "noun-project"
#cask "omnigraffle"
#cask "qlcolorcode"
#cask "qlimagesize"
cask "qlmarkdown"
#cask "qlprettypatch"
#cask "qlstephen"
#cask "quicklook-csv"
cask "quicklook-json"
#cask "skim"
cask "skype"
cask "slack"
cask "spamsieve"
cask "spotify"
cask "steam"
cask "teamviewer"
#cask "suspicious-package"
#cask "whatsapp"
#cask "xquartz"
#cask "zoomus"
cask "hazel"
cask "devonthink-pro-office"

brew "ag"
brew "argo"
brew "awscli"
#brew "bro"
#brew "bash-snippets"
#brew "clang-format"
#brew "cmake"
#brew "colordiff"
brew "coreutils"
brew "dnsmasq"
#brew "doxygen"
#brew "ffmpeg"
brew "emacs-mac"
brew "fd"
#brew "figlet"
#brew "flatbuffers", args: ["HEAD"]
#brew "gcc"
#brew "gcovr"
brew "gnupg"
#brew "google-benchmark"
#brew "gperftools"
brew "graphviz"
#brew "r"
brew "mtr"
brew "kubernetes-helm"
brew "kubernetes-cli"
brew "kubelogin"
# brew "hledger"
brew "htop"
brew "httpie"
brew "hub"
#brew "imagemagick"
brew "jhipster"
brew "jq"
brew "keychain"
brew "kubectx", args: ["with-short-names"]
brew "landscaper"
brew "ledger"
brew "libgit2"
#brew "lbdb"
brew "mackup"
#brew "macvim"
brew "mas"
brew "maven"
#brew "mdv"
#brew "mutt"
#brew "ninja"
#brew "nmap"
brew "node"
#brew "offlineimap"
#brew "opensc"
#brew "openssh"
#brew "p7zip"
#brew "par"
brew "php"
brew "postgresql"
#brew "procmail"
#brew "pstree"
#brew "pwgen"
brew "pinentry-mac"
brew "python"
brew "python3"
brew "pyenv"
brew "pyenv-virtualenv"
#brew "qcachegrind"
#brew "rocksdb"
brew "ruby"
brew "rbenv"
brew "skaffold"
#brew "snappy"
#brew "speedtest_cli"
#brew "stdman"
brew "terraform"
#brew "terminal-notifier"
brew "tmux"
#brew "tmux-mem-cpu-load"
brew "trash"
brew "tree"
brew "urlview"
#brew "vim", args: ["with-client-server", "with-override-system-vi"]
#brew "watch"
brew "w3m"
brew "wget"
#brew "youtube-dl"
brew "yq"
brew "zplug", args: ["HEAD"]
brew "zsh"

#mas "2Do", id: 477670270

mas "Clockodo", id: 991892390
mas "Reeder", id: 880001334
mas "Agenda", id: 1287445660
mas "OmniFocus", id: 1346203938
mas "Space Gremlin", id: 414515628
